РП/src/Documents/РегламентнаяОперацияМеждународныйУчет/РегламентнаяОперацияМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегламентнаяОперацияМеждународныйУчет</name>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипыРегламентныхОперацийМеждународныйУчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

РП/src/Enums/ТипыРегламентныхОперацийМеждународныйУчет/ТипыРегламентныхОперацийМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРегламентныхОперацийМеждународныйУчет</name>
  <enumValues>
    <name>РасчетКурсовыхРазницФункциональнаяВалюта</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетовДоходовРасходов</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВалютаПредставления</name>
  </enumValues>
</mdclass:Enum>

РП/src/Documents/РегламентнаяОперацияМеждународныйУчет/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// МенюОтчеты
	МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	// Конец МенюОтчеты

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ИзменитьЗаголовокПоТипуОперации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОперацииПриИзменении(Элемент)
	
	ТипОперацииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТипОперацииПриИзмененииНаСервере()
	
	ИзменитьЗаголовокПоТипуОперации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец МенюОтчеты


#Область СтандартныеПодсистемы_ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если Не ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтаФорма, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ИзменитьЗаголовокПоТипуОперации();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗаголовокПоТипуОперации()

	Создание = НСтр("ru='(создание)';uk='(створення)'");
	ТипыОпераций = Перечисления.ТипыРегламентныхОперацийМеждународныйУчет;
	Если Объект.ТипОперации = ТипыОпераций.ЗакрытиеСчетовДоходовРасходов Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									Документы.РегламентнаяОперацияМеждународныйУчет.ПредставлениеЗакрытияДоходовРасходов(),
									Объект.Номер,
									Объект.Дата);
		Иначе
			Заголовок = Документы.РегламентнаяОперацияМеждународныйУчет.ПредставлениеЗакрытияДоходовРасходов(Ложь) + " " + Создание;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипОперации = ТипыОпераций.РасчетКурсовыхРазницФункциональнаяВалюта Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									Документы.РегламентнаяОперацияМеждународныйУчет.ПредставлениеРасчетКурсовыхРазницФункциональнойВалюте(),
									Объект.Номер,
									Объект.Дата);
		Иначе
			Заголовок = Документы.РегламентнаяОперацияМеждународныйУчет.ПредставлениеРасчетКурсовыхРазницФункциональнойВалюте(Ложь) + " " + Создание;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипОперации = ТипыОпераций.РасчетКурсовыхРазницВалютаПредставления Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									Документы.РегламентнаяОперацияМеждународныйУчет.ПредставлениеРасчетКурсовыхРазниВалютеПредставления(),
									Объект.Номер,
									Объект.Дата);
		Иначе
			Заголовок = Документы.РегламентнаяОперацияМеждународныйУчет.ПредставлениеРасчетКурсовыхРазниВалютеПредставления(Ложь) + " " + Создание;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru='Регламентная операция (международный учет) %1 от %2';uk='Регламентна операція (міжнародний облік) %1 від %2'"),
									Объект.Номер,
									Объект.Дата);
		Иначе
			Заголовок = НСтр("ru='Регламентная операция (международный учет) (создание)';uk='Регламентна операція (міжнародний облік) (створення)'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область СтандартныеПодсистемы_ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
